<?php

return [

    /*
    |--------------------------------------------------------------------------
    | FAQ
    |--------------------------------------------------------------------------
    */

    'title' => 'الأسئلة الشائعة',
    'description' => 'ابحث عن إجابات للأسئلة الشائعة حول استخدام المنصة.',
    'still_have_questions' => 'هل لا تزال لديك أسئلة؟',
    'contact_support' => 'فريقنا هنا لمساعدتك في أي شيء تحتاجه.',
    'qa' => [
        [
            'q' => 'كيف يمكنني العثور على بطاقات الولاء الخاصة بي؟',
            'a' => 'ستجد عادةً رمز QR أو رابطًا يوجهك إلى بطاقة الولاء الخاصة بك.',
        ],
        [
            'q' => 'كيف أكسب النقاط مع مشترياتي؟',
            'a' => 'عند قيامك بعملية شراء، قدم بطاقة الولاء الخاصة بك من هاتفك. تحتوي البطاقة على رمز QR فريد. سيقوم موظفو المتجر بمسحه لإضافة النقاط إلى حسابك.',
        ],
        [
            'q' => 'كيف يمكنني استرداد مكافآتي؟',
            'a' => "بمجرد حصولك على نقاط كافية، افتح المكافأة المحددة واضغط على 'استرداد المكافأة'. سيتم توليد رمز QR ليقوم موظفو المتجر بمسحه. ستخصم نقاطك وستحصل على مكافأتك.",
        ],
        [
            'q' => 'هل سيحصل الموظفون على معلوماتي الشخصية؟',
            'a' => 'لا، سيشاهد الموظفون فقط الاسم الذي قدمته عند التسجيل ورمز العضوية الفريد الخاص بك. تبقى بريدك الإلكتروني وتفاصيلك الأخرى خاصة.',
        ],
        [
            'q' => 'هل سيحصل أصحاب الأعمال على معلوماتي الشخصية؟',
            'a' => 'يمكن لأصحاب الأعمال رؤية عنوان بريدك الإلكتروني واسمك، وما إذا كنت قد سمحت لهم بإرسال عروض خاصة لك. لا يمكنهم الوصول إلى أي تفاصيل شخصية أخرى.',
        ],
        [
            'q' => 'كيف يمكنني التحقق من رصيد نقاطي الحالي؟',
            'a' => 'سجل الدخول إلى حسابك على موقعنا أو تطبيقنا. سيتم عرض رصيد نقاطك على بطاقة الولاء الخاصة بك.',
        ],
        [
            'q' => 'هل يمكنني تحويل نقاطي إلى حساب آخر؟',
            'a' => "نعم، يمكن تحويل النقاط بين الأعضاء باستخدام ميزة 'طلب النقاط'.",
        ],
        [
            'q' => 'ماذا يجب علي أن أفعل إذا فقدت الوصول إلى بطاقة الولاء الخاصة بي؟',
            'a' => 'سجل الدخول إلى حسابك على موقعنا أو تطبيقنا لاستعادة بطاقتك. إذا استمرت المشكلة، اتصل بفريق الدعم الخاص بنا للحصول على المساعدة.',
        ],
        [
            'q' => 'هل تنتهي صلاحية نقاطي؟',
            'a' => 'نعم، تنتهي صلاحية النقاط. تحقق من الشروط والأحكام الخاصة ببطاقة الولاء الخاصة بك لمعرفة سياسات انتهاء الصلاحية.',
        ],
        [
            'q' => 'كيف يمكنني تحديث معلوماتي الشخصية؟',
            'a' => "سجل الدخول إلى حسابك وانتقل إلى قسم 'الملف الشخصي'. قم بإجراء التغييرات اللازمة واحفظ التحديثات.",
        ],
    ],
];
